ProgessBase/InformationRegisters/ПРГ_ПериодическиеСвойстваОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_ПериодическиеСвойстваОбъектов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Enums/ВидыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сборочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Узел</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/CommonModules/МЗ_МолочныйЗавод/Ext/Module.bsl
Функция ПолучитьКачественныйПоказатель(Номенклатура, Свойство, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПРГ_ПериодическиеСвойстваОбъектовСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ПРГ_ПериодическиеСвойстваОбъектов.СрезПоследних(
	|			&ДатаСреза,
	|			Объект = &Номенклатура
	|				И Свойство = &Свойство) КАК ПРГ_ПериодическиеСвойстваОбъектовСрезПоследних");
	
	Запрос.УстановитьПараметр("ДатаСреза", 		Дата);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("Свойство",		Свойство);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Значение;
	Иначе
		Результат = Номенклатура.ПРГ_Базис;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределитьСпецификациюДляПобочногоПродукта(СтрокаПродукции, ТабПродукция, Дата, Подразделение) Экспорт
	
	ПРГ_ИсппользуетсяБлокМолочногоПроизводства = ПРГ_ДопФункцииКлиентСервер.ПРГ_ИсппользуетсяБлокМолочногоПроизводства(Дата);
	
	СпецификацияПобочногоПродукта = СтрокаПродукции.Спецификация;
	
	Если Не ПРГ_ИсппользуетсяБлокМолочногоПроизводства Тогда
		Возврат СпецификацияПобочногоПродукта;
	КонецЕсли;
	
	Если ТабПродукция.Количество() < 2 Тогда
		Возврат СпецификацияПобочногоПродукта;
	КонецЕсли;
	
	Если ТабПродукция.Индекс(СтрокаПродукции) < 1 Тогда
		Возврат СпецификацияПобочногоПродукта;
	КонецЕсли;
	
	СтрокаОсновногоПродукта = ТабПродукция[0];
	
	Если Не ЗначениеЗаполнено(СтрокаОсновногоПродукта.Спецификация)
		ИЛИ Не СтрокаОсновногоПродукта.Спецификация.ВидСпецификации = Перечисления.ВидыСпецификаций.Полная Тогда
	    Возврат СпецификацияПобочногоПродукта;
	КонецЕсли;
	
	СтрокиСпецификации = СтрокаОсновногоПродукта.Спецификация.ВыходныеИзделия.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаПродукции.Номенклатура, СтрокаПродукции.ХарактеристикаНоменклатуры));
	Если СтрокиСпецификации.Количество() > 0 Тогда
		Возврат СтрокаОсновногоПродукта.Спецификация;
	КонецЕсли;
	
	Возврат СпецификацияПобочногоПродукта;
КонецФункции
